aliahmadi9371/access/cyp-code/cy-micro/origin/cy-notask/Start/BoardSupport/Cypress/CY8C5868_CY8CKIT_050_PSoC5_DK/Start_CY8C5868_AccessV2.0_OldBrd.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "UART_Debug.h"
#include "UART_Linux.h"
#include "LED_RGB_aliases.h"
#include "LED_RGB.h"
#include "intr_Port1.h"
#include "intr_Port2.h"
#include "Relay_Port2_aliases.h"
#include "Relay_Port2.h"
#include "intr_UART_Linux_Rx.h"
#include "Relay_Port1_aliases.h"
#include "Relay_Port1.h"
#include "Pins_Port2_aliases.h"
#include "Pins_Port2.h"
#include "Pins_Port1_aliases.h"
#include "Pins_Port1.h"
#include "In4_aliases.h"
#include "In4.h"
#include "In5_aliases.h"
#include "In5.h"
#include "Internal_EEPROM.h"
#include "Bootloadable.h"
#include "Inp_1_aliases.h"
#include "Inp_1.h"
#include "Inp_2_aliases.h"
#include "Inp_2.h"
#include "UART_Debug_IntClock.h"
#include "UART_Linux_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

